package com.example.final_project;
//كلاس للاستخدام العام نضع فيه الدوال والمتغيرات الخاصة كي نتمكن من استعمالها لاحقًا
//هنا لاحظ أننا نتعامل مع الدوال والمتغيرات كستاتيك لاننا لا نريد انشاء نسخة
//بل سنتسدهيها باسم الكلاس
public class Util {
    //دالة تقوم بمعالجة سؤال وارجاعه للجزء الذي استدعاه
    public static Question generteQuestion(){
        String [][] x=new String[3][3];
        //هنا ننشئ مصفوفة رباعية ثلاثية تحتوي على قيم مبدئيةأصفار
        //من1-10
        int startNumber = (int) (Math.random()*10)+1;
        //هنا نعالج رقم عشوائي أيضًا ليتم زيادته على المصفوفة كل مرة
        // لاحظ أننا نعالج رقم البداية فقط ثم بعد ذلك نزيد رقم ثابت
        int incStartNumber = (int) (Math.random()*5)+1;
        //تعرف متغير لكيّ نخزن فيه الرقم التالي
        int stredNumber;
        // نعرّف متغير لكيّ نخزن فيه الرقم المفقود
        int number = -1;
        //نعمل لوب لكيّ نخزن العناصر في المصفوفة
        for (int i = 0 ; i<x.length;i++){
            for (int j = 0 ; j < x[i].length; j++){
                //المعالج الذي ننوي تخزينه في المصفوفة في متغير مستقل لكيّ نستخدمه لاحقًا
                stredNumber= startNumber+incStartNumber;
                // ثم السابق في المتغير الخاص بالرقم المفقود ونضع علامة استفهام في المصفوفة
                if (i==1&& j==1){
                    number =stredNumber; // الاجابة الصحيحة للرقم المخفي
                    x [i][j] = number+"";
                }else {
                    //أي خانة أخرى نخزن فيها الرقم المعالج مسبقًا
                    x [i][j]= stredNumber+"";
                }
                //نزيد المتغير الخاص بالزيادة بمقدار 2
                incStartNumber +=2;
                // القيمة المخزنة الجديدة لأن العنصر التالي يعتمد على العنصر السابق له
                startNumber=stredNumber;
            }
        }
        //نخزن المصفوفة المعالجة والرقم المفقود في أوبجكت من نوع سؤال ونرسله لمن طلبه
        return new Question(x,number);
    }
}
